/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "无法完成操作";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "稍后再试。";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "无法打开";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "不支持此媒体的格式。";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "无法打开";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "此媒体可能已损坏。";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "无法打开";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "此应用未得到授权来播放此文件。"; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "无法打开";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "无法使用此媒体。";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "不能解码";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "此媒体所需的解码器正忙。";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "停止执行任何其他对媒体进行解码的操作，然后再试一次。";
